Revit 2026 API

# LineLoadMomentVector2 Property

---

The moment vector applied to the end point of the line load, oriented according to OrientTo setting.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ MomentVector2 { get; set; }
```
```vb
Public Property MomentVector2 As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ MomentVector2 {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member MomentVector2 : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The default force unit is kN-m/m for metric, and kip-ft/ft for imperial. Use UnitUtils class methods to convert value from or to internal units.

#### Reference

LineLoad Class

Autodesk.Revit.DB.Structure Namespace